{
  "profiles": {
    "profile1": {
      "id": 1,
      "name": "Minh",
      "birthday": "1995-05-10",
      "bio": "Yêu thích âm nhạc, nghệ thuật và khám phá những địa điểm mới.",
      "favoriteColor": "#FF5757",
      "imageUrl": "/images/profile1.jpg"
    },
    "profile2": {
      "id": 2,
      "name": "Linh",
      "birthday": "1996-08-15",
      "bio": "Đam mê đọc sách, nấu ăn và đi du lịch cùng người yêu.",
      "favoriteColor": "#5D9CEC",
      "imageUrl": "/images/profile2.jpg"
    }
  },
  "relationship": {
    "id": 1,
    "startDate": "2020-11-09",
    "title": "Mối tình đẹp",
    "description": "Một hành trình tình yêu tràn đầy kỷ niệm đẹp, niềm vui và sự tôn trọng lẫn nhau.",
    "song": "Em Của Ngày Hôm Qua - Sơn Tùng MTP",
    "songUrl": "/sounds/love-song.mp3",
    "coupleImageUrl": "/images/couple.jpg"
  },
  "events": [
    {
      "id": 1,
      "title": "Ngày đầu tiên gặp nhau",
      "date": "2020-11-02",
      "shortDescription": "Chúng mình gặp nhau lần đầu tại quán cà phê ở phố cổ.",
      "fullDescription": "Hôm đó là một ngày thu đẹp trời, tình cờ chúng mình gặp nhau tại quán cà phê yên tĩnh ở phố cổ. Cuộc trò chuyện đầu tiên đã kéo dài hơn 3 tiếng đồng hồ mà không ai muốn kết thúc. Từ âm nhạc, sách, đến những ước mơ trong tương lai - chúng mình đã chia sẻ mọi thứ như đã quen nhau từ rất lâu.",
      "imageUrl": "/images/first-meet.jpg"
    },
    {
      "id": 2,
      "title": "Bắt đầu hẹn hò",
      "date": "2020-11-09",
      "shortDescription": "Chính thức trở thành một cặp sau buổi hẹn dưới trời sao.",
      "fullDescription": "Sau một tuần nói chuyện liên tục qua điện thoại, chúng mình quyết định gặp nhau lần nữa tại công viên. Dưới bầu trời đầy sao, chúng mình đã chia sẻ những cảm xúc chân thành và quyết định bắt đầu một hành trình mới cùng nhau. Đó là khoảnh khắc mà cả hai đều biết rằng điều gì đó rất đặc biệt đang bắt đầu.",
      "imageUrl": "/images/start-dating.jpg"
    },
    {
      "id": 3,
      "title": "Kỷ niệm 100 ngày yêu",
      "date": "2021-02-17",
      "shortDescription": "Cùng nhau đón kỷ niệm 100 ngày yêu tại Đà Lạt.",
      "fullDescription": "Để kỷ niệm 100 ngày bên nhau, chúng mình đã quyết định đi Đà Lạt - nơi mà cả hai đều mơ ước được đến cùng nhau. Những ngày tại thành phố mộng mơ đã để lại nhiều kỷ niệm khó quên: cùng nhau đạp xe quanh hồ Xuân Hương, thưởng thức cà phê trong sáng sớm se lạnh và nắm tay nhau dạo bước dưới những hàng thông. Đây là chuyến đi đầu tiên của chúng mình và cũng là lúc chúng mình biết rằng chúng mình có thể cùng nhau đi đến bất cứ đâu.",
      "imageUrl": "/images/100-days.jpg"
    }
  ],
  "photos": [
    {
      "id": 1,
      "title": "Lần đầu đi xem phim cùng nhau",
      "date": "2020-11-20",
      "description": "Buổi tối đi xem 'Tenet' tại rạp sau ngày làm việc mệt mỏi.",
      "imageUrl": "/images/movie-date.jpg"
    },
    {
      "id": 2,
      "title": "Picnic cuối tuần",
      "date": "2021-03-27",
      "description": "Buổi picnic đầu tiên tại công viên thành phố vào một ngày xuân đẹp trời.",
      "imageUrl": "/images/picnic.jpg"
    },
    {
      "id": 3,
      "title": "Sinh nhật của Linh",
      "date": "2021-08-15",
      "description": "Bữa tiệc sinh nhật bất ngờ cho Linh tại nhà với bạn bè thân thiết.",
      "imageUrl": "/images/birthday-linh.jpg"
    }
  ]
}
